# 7. Ի՞նչ կտպվի հետևյալ կոդի կատարման արդյունքում (error-ի դեպքում հենց այդպես էլ նշել)։ Հիմնավորել պատասխանը։
a = [[]] * 3
a[1].append(1)
print(a) 


# Կտպի [[1], [1], [1]]

# a = [[]] * 3 կստեղծի [[], [], []] , և բոլոր nested-ների վրա միևնույն հղումները կլինեն։ Այլ կերպ ասած, բոլոր երեք
# օբյեկտները հիշողության մեջ նույն օբյեկտը կհանդիսանան։ Դրա համար append անելով միանգամից երեք տեղում էլ գրվում է 1:
# Կարող էինք գրել a[0].append(1) կամ a[2].append(1) ու էլի նույն արդյունքը կլիներ։
